In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import re
import datetime as dt

In [32]:
df = pd.read_table('python_scripts/ETL_python_scripts/content.txt', sep="|", header=0, index_col=1)

In [33]:
df.head()

,Unnamed: 0,date,time,city_name,temp_c,temp_f,Unnamed: 7
weather_id,,,,,,,
:------------------------------------------------------,NaN,:-----------,:----------------,:------------,---------:,---------:,NaN
202301-2808-2155-27638a26-1510-408c-a198-954c7614d796,NaN,2023-01-28,08:21:55.778829,Moscow,-3,26,NaN
202301-2808-2158-a526693d-ba05-4d06-b45c-d8a4dd7b8bbb,NaN,2023-01-28,08:21:58.485620,London,4,39,NaN

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, :------------------------------------------------------ to  202301-2808-2158-a526693d-ba05-4d06-b45c-d8a4dd7b8bbb
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         0 non-null      float64
 1    date              3 non-null      object
 2    time              3 non-null      object
 3    city_name         3 non-null      object
 4      temp_c          3 non-null      object
 5      temp_f          3 non-null      object
 6   Unnamed: 7         0 non-null      float64
dtypes: float64(2), object(5)
memory usage: 192.0+ bytes

In [35]:
df = df.dropna(axis=1, how='all')

In [36]:
df = df.drop([':------------------------------------------------------'])

In [37]:
df.columns

Index([' date       ', ' time            ', ' city_name   ', '   temp_c ',
       '   temp_f '],
      dtype='object')

In [38]:
df.columns = ['date', 'time', 'city_name', 'temp_c', 'temp_f']

In [39]:
df.head()

,date,time,city_name,temp_c,temp_f
weather_id,,,,,
202301-2808-2155-27638a26-1510-408c-a198-954c7614d796,2023-01-28,08:21:55.778829,Moscow,-3,26
202301-2808-2158-a526693d-ba05-4d06-b45c-d8a4dd7b8bbb,2023-01-28,08:21:58.485620,London,4,39

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries,  202301-2808-2155-27638a26-1510-408c-a198-954c7614d796  to  202301-2808-2158-a526693d-ba05-4d06-b45c-d8a4dd7b8bbb
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       2 non-null      object
 1   time       2 non-null      object
 2   city_name  2 non-null      object
 3   temp_c     2 non-null      object
 4   temp_f     2 non-null      object
dtypes: object(5)
memory usage: 96.0+ bytes

In [41]:
import sys

In [42]:
sys.path.append('python_scripts/')

# write to DB

In [43]:
from ETL_python_scripts import ETL_secrets

In [44]:
#importing public libraries
from sqlalchemy import create_engine



engine = create_engine(
    'postgresql://{user}:{password}@{host}:{port}/{bd_name}'.format(
        user = ETL_secrets.postgres_user,
        password = ETL_secrets.postgres_password,
        host = ETL_secrets.postgres_host,
        port = ETL_secrets.postgres_port,
        bd_name = ETL_secrets.postgres_db)
        )

In [45]:
engine

Engine(postgresql://postgres:***@postgres:5432/postgres_db)

In [46]:
table_name = 'weather'
df.to_sql(table_name, engine, if_exists='replace')

2

# read from DB

In [47]:
sql_query = f'select * from {table_name}'
df_from_db = pd.read_sql_query(sql_query, con=engine)

In [48]:
df_from_db

,weather_id,date,time,city_name,temp_c,temp_f
0,202301-2808-2155-27638a26-1510-408c-a198-954c...,2023-01-28,08:21:55.778829,Moscow,-3,26
1,202301-2808-2158-a526693d-ba05-4d06-b45c-d8a4...,2023-01-28,08:21:58.485620,London,4,39

удивительно, но пишет в БД и даже вычитывает.
Надо разобраться с пересборой контейнеров. Почему-то опять были проблемы с библиотекой tabulate хотя в коде ее нет.